Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Architecture.RailingPlacementPosition)
Creates new railings with the specified railing type on all sides of a stairs instance in a Autodesk.Revit.DB.Architecture.MultistoryStairs element.
document:
The document.
multistoryStairsId:
The id of the Autodesk.Revit.DB.Architecture.MultistoryStairs that contains the stairs which will be the host of this railing.
The stairs should have no associated railings yet.
levelId:
The level of stairs on which the new railing will be created.
The level should be one of levels defining the Autodesk.Revit.DB.Architecture.MultistoryStairs element.
railingTypeId:
The railing type of the new railing to be created.
placePosition:
The placement position of the new railing.
Returns:
The new railing instances successfully created on the stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The railingTypeId is not a railing type.
-or-
The levelId is not a valid level id for a railing.
-or-
The levelId is not a level of Autodesk.Revit.DB.Architecture.MultistoryStairs stairs element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The multistoryStairsId already has associated railings or is in editing mode so association of railings is not permitted.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Architecture.Railing.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new railing by specifying the railing path in the project document.
document:
The document.
curveLoop:
The railing path along which the new railing will be created.
The curveLoop should be continuous with curves which are only bounded lines and arcs on the same horizontal plane.
It also has to have maximum two curves meet in one end point.
railingTypeId:
The railing type of the new railing to be created.
baseLevelId:
The base level on which the new railing will be created.
Returns:
The new railing instance if creation was successful, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curveLoop must be a single connected path, located on the same horizontal plane and defined using lines or arcs only.
It also has to have maximum two curves meet in one end point.
-or-
The railingTypeId is not a railing type.
-or-
The baseLevelId is not a valid level id for a railing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017